In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# Any results you write to the current directory are saved as output.

/kaggle/input/titanic/gender_submission.csv
/kaggle/input/titanic/test.csv
/kaggle/input/titanic/train.csv

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

In [3]:
train_data=pd.read_csv('/kaggle/input/titanic/train.csv')
# train_data_copy=read_csv()
test_data=pd.read_csv('/kaggle/input/titanic/test.csv')

In [4]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
train_data.shape

(891, 12)

In [6]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
train_data.drop(columns='Cabin',axis=1,inplace=True)

In [8]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [9]:
train_data.Age.fillna(value=train_data.Age.mean(),inplace=True)

In [10]:
train_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [11]:
train_data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [12]:
train_data.loc[train_data.Embarked=='S'].count()

PassengerId    644
Survived       644
Pclass         644
Name           644
Sex            644
Age            644
SibSp          644
Parch          644
Ticket         644
Fare           644
Embarked       644
dtype: int64

In [13]:
#maximum embarked have value S so lets replace null with S
train_data.loc[train_data.Embarked=='S']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,S
...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.000000,0,0,C.A./SOTON 34068,10.5000,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.000000,0,0,SOTON/OQ 392076,7.0500,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,S

In [14]:
train_data.loc[train_data.Embarked.isna()].Embarked

61     NaN
829    NaN
Name: Embarked, dtype: object

In [15]:
train_data.loc[train_data.Embarked.isna()].Embarked

61     NaN
829    NaN
Name: Embarked, dtype: object

In [16]:
train_data.Embarked.fillna(value='S',inplace=True)

In [17]:
train_data.loc[train_data.Embarked.isna()].Embarked

Series([], Name: Embarked, dtype: object)

In [18]:
train_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [19]:
#now our data has no missing values
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [20]:
filtered_train_data=train_data[['PassengerId','Pclass','Sex','Age','SibSp','Parch','Embarked']]

In [21]:
filtered_train_data.set_index('PassengerId',inplace=True)

In [22]:
filtered_train_data.head()

             Pclass     Sex   Age  SibSp  Parch Embarked
PassengerId
1                 3    male  22.0      1      0        S
2                 1  female  38.0      1      0        C
3                 3  female  26.0      0      0        S
4                 1  female  35.0      1      0        S
5                 3    male  35.0      0      0        S

In [23]:
Y_train=train_data['Survived']

In [24]:
Y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [25]:
filtered_train_data.Pclass.unique()

array([3, 1, 2])

In [26]:
filtered_train_data.Sex.unique()

array(['male', 'female'], dtype=object)

In [27]:
filtered_train_data.Sex.replace({'male':1,'female':0},inplace=True)

/opt/conda/lib/python3.6/site-packages/pandas/core/generic.py:6786: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [28]:
filtered_train_data.head()

             Pclass  Sex   Age  SibSp  Parch Embarked
PassengerId
1                 3    1  22.0      1      0        S
2                 1    0  38.0      1      0        C
3                 3    0  26.0      0      0        S
4                 1    0  35.0      1      0        S
5                 3    1  35.0      0      0        S

In [29]:
filtered_train_data.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [30]:
filtered_train_data.Embarked.replace({'S':0,'C':1,'Q':2},inplace=True)

In [31]:
filtered_train_data.head()

             Pclass  Sex   Age  SibSp  Parch  Embarked
PassengerId
1                 3    1  22.0      1      0         0
2                 1    0  38.0      1      0         1
3                 3    0  26.0      0      0         0
4                 1    0  35.0      1      0         0
5                 3    1  35.0      0      0         0

In [32]:
filtered_train_data.Parch.unique()

array([0, 1, 2, 5, 3, 4, 6])

In [33]:
min=filtered_train_data.Age.min()
max=filtered_train_data.Age.max()
print(min," ",max)

0.42   80.0

In [34]:
filtered_train_data.Age=(filtered_train_data.Age-min)/(max-min)

/opt/conda/lib/python3.6/site-packages/pandas/core/generic.py:5208: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [35]:
filtered_train_data.head()

             Pclass  Sex       Age  SibSp  Parch  Embarked
PassengerId
1                 3    1  0.271174      1      0         0
2                 1    0  0.472229      1      0         1
3                 3    0  0.321438      0      0         0
4                 1    0  0.434531      1      0         0
5                 3    1  0.434531      0      0         0

In [36]:
# model=DecisionTreeClassifier()
model=RandomForestClassifier(n_estimators=10,max_leaf_nodes=10,random_state=0)

In [37]:
model.fit(filtered_train_data,Y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=10, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=0, verbose=0,
                       warm_start=False)

In [38]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [39]:
test_data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [40]:
filtered_test_data=test_data[['PassengerId','Pclass','Sex','Age','SibSp','Parch','Embarked']]

In [41]:
filtered_test_data.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch Embarked
0          892       3    male  34.5      0      0        Q
1          893       3  female  47.0      1      0        S
2          894       2    male  62.0      0      0        Q
3          895       3    male  27.0      0      0        S
4          896       3  female  22.0      1      1        S

In [42]:
filtered_test_data.set_index('PassengerId',inplace=True)

In [43]:
filtered_test_data.Sex.replace({'male':1,'female':0},inplace=True)

/opt/conda/lib/python3.6/site-packages/pandas/core/generic.py:6786: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [44]:
filtered_test_data.Age.fillna(value=filtered_test_data.Age.mean(),inplace=True)

/opt/conda/lib/python3.6/site-packages/pandas/core/generic.py:6287: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [45]:
test_min=filtered_test_data.Age.min()
test_max=filtered_test_data.Age.max()
print(max," ",min)

80.0   0.42

In [46]:
filtered_test_data.Age=(filtered_test_data.Age-test_min)/(test_max-test_min)

/opt/conda/lib/python3.6/site-packages/pandas/core/generic.py:5208: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [47]:
filtered_test_data.head()

             Pclass  Sex       Age  SibSp  Parch Embarked
PassengerId
892               3    1  0.452723      0      0        Q
893               3    0  0.617566      1      0        S
894               2    1  0.815377      0      0        Q
895               3    1  0.353818      0      0        S
896               3    0  0.287881      1      1        S

In [48]:
filtered_test_data.Embarked.replace({'S':0,'C':1,'Q':2},inplace=True)

In [49]:
filtered_test_data.head()

             Pclass  Sex       Age  SibSp  Parch  Embarked
PassengerId
892               3    1  0.452723      0      0         2
893               3    0  0.617566      1      0         0
894               2    1  0.815377      0      0         2
895               3    1  0.353818      0      0         0
896               3    0  0.287881      1      1         0

In [50]:
Y_pred=model.predict(filtered_test_data)

In [51]:
predicted_y=pd.DataFrame({'PassengerId':filtered_test_data.index,'Survived':Y_pred})

In [52]:
predicted_y.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [53]:
predicted_y.to_csv('submission.csv',index=False)